Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define ADTBL16 ADTBL16
extern volatile unsigned int  ADTBL16 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL16BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL16BITS;
extern volatile ADTBL16BITS ADTBL16bits __attribute__((__sfr__));

#define ADTBL17 ADTBL17
extern volatile unsigned int  ADTBL17 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL17BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL17BITS;
extern volatile ADTBL17BITS ADTBL17bits __attribute__((__sfr__));

#define ADTBL18 ADTBL18
extern volatile unsigned int  ADTBL18 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL18BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL18BITS;
extern volatile ADTBL18BITS ADTBL18bits __attribute__((__sfr__));

#define ADTBL19 ADTBL19
extern volatile unsigned int  ADTBL19 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL19BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL19BITS;
extern volatile ADTBL19BITS ADTBL19bits __attribute__((__sfr__));

#define ADTBL20 ADTBL20
extern volatile unsigned int  ADTBL20 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL20BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL20BITS;
extern volatile ADTBL20BITS ADTBL20bits __attribute__((__sfr__));

#define ADTBL21 ADTBL21
extern volatile unsigned int  ADTBL21 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL21BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL21BITS;
extern volatile ADTBL21BITS ADTBL21bits __attribute__((__sfr__));

#define ADTBL22 ADTBL22
extern volatile unsigned int  ADTBL22 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL22BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL22BITS;
extern volatile ADTBL22BITS ADTBL22bits __attribute__((__sfr__));

#define ADTBL23 ADTBL23
extern volatile unsigned int  ADTBL23 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL23BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL23BITS;
extern volatile ADTBL23BITS ADTBL23bits __attribute__((__sfr__));

#define ADTBL24 ADTBL24
extern volatile unsigned int  ADTBL24 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL24BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL24BITS;
extern volatile ADTBL24BITS ADTBL24bits __attribute__((__sfr__));

#define ADTBL25 ADTBL25
extern volatile unsigned int  ADTBL25 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL25BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL25BITS;
extern volatile ADTBL25BITS ADTBL25bits __attribute__((__sfr__));

#define ADTBL26 ADTBL26
extern volatile unsigned int  ADTBL26 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL26BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL26BITS;
extern volatile ADTBL26BITS ADTBL26bits __attribute__((__sfr__));

#define ADTBL27 ADTBL27
extern volatile unsigned int  ADTBL27 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL27BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL27BITS;
extern volatile ADTBL27BITS ADTBL27bits __attribute__((__sfr__));

#define ADTBL28 ADTBL28
extern volatile unsigned int  ADTBL28 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL28BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL28BITS;
extern volatile ADTBL28BITS ADTBL28bits __attribute__((__sfr__));

