Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
extern volatile ANSFBITS ANSFbits __attribute__((__sfr__));

#define ANSG ANSG
extern volatile unsigned int  ANSG __attribute__((__sfr__));
typedef struct tagANSGBITS {
  unsigned :6;
  unsigned ANSG6:1;
  unsigned ANSG7:1;
  unsigned ANSG8:1;
  unsigned ANSG9:1;
} ANSGBITS;
extern volatile ANSGBITS ANSGbits __attribute__((__sfr__));

#define ADCON1 ADCON1
extern volatile unsigned int  ADCON1 __attribute__((__sfr__));
__extension__ typedef struct tagADCON1BITS {
  union {
    struct {
      unsigned PWRLVL:1;
      unsigned :5;
      unsigned ADCAL:1;
      unsigned PUMPEN:1;
      unsigned FORM:4;
      unsigned ADSLP:1;
      unsigned ADSIDL:1;
      unsigned :1;
      unsigned ADON:1;
    };
    struct {
      unsigned :8;
      unsigned FORM0:1;
      unsigned FORM1:1;
      unsigned FORM2:1;
      unsigned FORM3:1;
    };
  };
} ADCON1BITS;
extern volatile ADCON1BITS ADCON1bits __attribute__((__sfr__));

#define ADCON2 ADCON2
extern volatile unsigned int  ADCON2 __attribute__((__sfr__));
__extension__ typedef struct tagADCON2BITS {
  union {
    struct {
      unsigned :1;
      unsigned REFPUMP:1;
      unsigned :8;
      unsigned BUFORG:1;
      unsigned :1;
      unsigned NVCFG0:1;
      unsigned :1;
      unsigned PVCFG:2;
    };
    struct {
      unsigned :12;
      unsigned NVCFG:1;
      unsigned :1;
      unsigned PVCFG0:1;
      unsigned PVCFG1:1;
    };
    struct {
      unsigned :1;
      unsigned RFPUMP:1;
    };
  };
} ADCON2BITS;
extern volatile ADCON2BITS ADCON2bits __attribute__((__sfr__));

#define ADCON3 ADCON3
extern volatile unsigned int  ADCON3 __attribute__((__sfr__));
__extension__ typedef struct tagADCON3BITS {
  union {
    struct {
      unsigned ADCS:8;
      unsigned :7;
      unsigned ADRC:1;
    };
    struct {
      unsigned ADCS0:1;
      unsigned ADCS1:1;
      unsigned ADCS2:1;
      unsigned ADCS3:1;
      unsigned ADCS4:1;
      unsigned ADCS5:1;
      unsigned ADCS6:1;
      unsigned ADCS7:1;
    };
    struct {
      unsigned :8;
      unsigned SLEN:4;
    };
    struct {
      unsigned :8;
      unsigned SLEN0:1;
      unsigned SLEN1:1;
      unsigned SLEN2:1;
      unsigned SLEN3:1;
    };
  };
} ADCON3BITS;
extern volatile ADCON3BITS ADCON3bits __attribute__((__sfr__));

#define ADTMRPR ADTMRPR
extern volatile unsigned int  ADTMRPR __attribute__((__sfr__));
#define ADSTAT ADSTAT
extern volatile unsigned long ADSTAT __attribute__((__sfr__));
#define ADSTATL ADSTATL
extern volatile unsigned int  ADSTATL __attribute__((__sfr__));
__extension__ typedef struct tagADSTATLBITS {
  union {
    struct {
      unsigned SL0IF:1;
      unsigned SL1IF:1;
      unsigned SL2IF:1;
      unsigned SL3IF:1;
      unsigned ACCIF:1;
      unsigned BUFIF:1;
      unsigned :2;
      unsigned SLERR:4;
    };
    struct {
      unsigned :8;
      unsigned SLERR0:1;
      unsigned SLERR1:1;
      unsigned SLERR2:1;
      unsigned SLERR3:1;
    };
    struct {
      unsigned :8;
      unsigned SLOV:1;
    };
  };
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADSTATH ADSTATH
extern volatile unsigned int  ADSTATH __attribute__((__sfr__));
typedef struct tagADSTATHBITS {
  unsigned ADBUSY:1;
  unsigned ADREADY:1;
  unsigned PUMPST:1;
} ADSTATHBITS;
extern volatile ADSTATHBITS ADSTATHbits __attribute__((__sfr__));

#define ACCON ACCON
extern volatile unsigned long ACCON __attribute__((__sfr__));
#define ACCONL ACCONL
extern volatile unsigned int  ACCONL __attribute__((__sfr__));
__extension__ typedef struct tagACCONLBITS {
  union {
    struct {
      unsigned COUNT:8;
      unsigned TBLSEL:6;
    };
    struct {
      unsigned COUNT0:1;
      unsigned COUNT1:1;
      unsigned COUNT2:1;
      unsigned COUNT3:1;
      unsigned COUNT4:1;
      unsigned COUNT5:1;
      unsigned COUNT6:1;
      unsigned COUNT7:1;
      unsigned TBLSEL0:1;
      unsigned TBLSEL1:1;
      unsigned TBLSEL2:1;
      unsigned TBLSEL3:1;
      unsigned TBLSEL4:1;
      unsigned TBLSEL5:1;
    };
  };
} ACCONLBITS;
extern volatile ACCONLBITS ACCONLbits __attribute__((__sfr__));

#define ACCONH ACCONH
extern volatile unsigned int  ACCONH __attribute__((__sfr__));
typedef struct tagACCONHBITS {
  unsigned :6;
  unsigned ACIE:1;
  unsigned ACEN:1;
} ACCONHBITS;
extern volatile ACCONHBITS ACCONHbits __attribute__((__sfr__));

#define ACRES ACRES
extern volatile unsigned long ACRES __attribute__((__sfr__));
#define ACRESL ACRESL
extern volatile unsigned int  ACRESL __attribute__((__sfr__));
#define ACRESH ACRESH
extern volatile unsigned int  ACRESH __attribute__((__sfr__));
#define ADCHIT ADCHIT
extern volatile unsigned long ADCHIT __attribute__((__sfr__));
#define ADCHITL ADCHITL
extern volatile unsigned int  ADCHITL __attribute__((__sfr__));
typedef struct tagADCHITLBITS {
  unsigned CHH0:1;
  unsigned CHH1:1;
  unsigned CHH2:1;
  unsigned CHH3:1;
  unsigned CHH4:1;
  unsigned CHH5:1;
  unsigned CHH6:1;
  unsigned CHH7:1;
  unsigned CHH8:1;
  unsigned CHH9:1;
  unsigned CHH10:1;
  unsigned CHH11:1;
  unsigned CHH12:1;
  unsigned CHH13:1;
  unsigned CHH14:1;
  unsigned CHH15:1;
} ADCHITLBITS;
extern volatile ADCHITLBITS ADCHITLbits __attribute__((__sfr__));

#define ADCHITH ADCHITH
extern volatile unsigned int  ADCHITH __attribute__((__sfr__));
typedef struct tagADCHITHBITS {
  unsigned CHH16:1;
  unsigned CHH17:1;
  unsigned CHH18:1;
  unsigned CHH19:1;
  unsigned CHH20:1;
  unsigned CHH21:1;
  unsigned CHH22:1;
  unsigned CHH23:1;
  unsigned CHH24:1;
  unsigned CHH25:1;
  unsigned CHH26:1;
  unsigned CHH27:1;
  unsigned CHH28:1;
  unsigned CHH29:1;
  unsigned CHH30:1;
  unsigned CHH31:1;
} ADCHITHBITS;
extern volatile ADCHITHBITS ADCHITHbits __attribute__((__sfr__));

#define ADL0CON ADL0CON
extern volatile unsigned long ADL0CON __attribute__((__sfr__));
#define ADL0CONL ADL0CONL
extern volatile unsigned int  ADL0CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL0CONLBITS {
  union {
    struct {
      unsigned SLSIZE:6;
      unsigned :1;
      unsigned THSRC:1;
      unsigned SLTSRC:5;
      unsigned SLENCLR:1;
      unsigned SAMP:1;
      unsigned SLEN:1;
    };
    struct {
      unsigned SLSIZE0:1;
      unsigned SLSIZE1:1;
      unsigned SLSIZE2:1;
      unsigned SLSIZE3:1;
      unsigned SLSIZE4:1;
      unsigned SLSIZE5:1;
      unsigned :2;
      unsigned SLTSRC0:1;
      unsigned SLTSRC1:1;
      unsigned SLTSRC2:1;
      unsigned SLTSRC3:1;
      unsigned SLTSRC4:1;
    };
  };
} ADL0CONLBITS;
extern volatile ADL0CONLBITS ADL0CONLbits __attribute__((__sfr__));

