Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
/* LCDDATA6 */
#define _S47C1 LCDDATA6bits.S47C1

/* LCDDATA7 */
#define _S48C1 LCDDATA7bits.S48C1
#define _S62C1 LCDDATA7bits.S62C1

/* LCDDATA8 */
#define _S0C2 LCDDATA8bits.S0C2
#define _S1C2 LCDDATA8bits.S1C2
#define _S2C2 LCDDATA8bits.S2C2
#define _S3C2 LCDDATA8bits.S3C2
#define _S4C2 LCDDATA8bits.S4C2
#define _S5C2 LCDDATA8bits.S5C2
#define _S6C2 LCDDATA8bits.S6C2
#define _S7C2 LCDDATA8bits.S7C2
#define _S8C2 LCDDATA8bits.S8C2
#define _S9C2 LCDDATA8bits.S9C2
#define _S10C2 LCDDATA8bits.S10C2
#define _S11C2 LCDDATA8bits.S11C2
#define _S12C2 LCDDATA8bits.S12C2
#define _S13C2 LCDDATA8bits.S13C2
#define _S14C2 LCDDATA8bits.S14C2
#define _S15C2 LCDDATA8bits.S15C2

/* LCDDATA9 */
#define _S16C2 LCDDATA9bits.S16C2
#define _S17C2 LCDDATA9bits.S17C2
#define _S18C2 LCDDATA9bits.S18C2
#define _S19C2 LCDDATA9bits.S19C2
#define _S20C2 LCDDATA9bits.S20C2
#define _S21C2 LCDDATA9bits.S21C2
#define _S22C2 LCDDATA9bits.S22C2
#define _S23C2 LCDDATA9bits.S23C2
#define _S24C2 LCDDATA9bits.S24C2
#define _S25C2 LCDDATA9bits.S25C2
#define _S26C2 LCDDATA9bits.S26C2
#define _S27C2 LCDDATA9bits.S27C2
#define _S30C2 LCDDATA9bits.S30C2

/* LCDDATA10 */
#define _S47C2 LCDDATA10bits.S47C2

/* LCDDATA11 */
#define _S48C2 LCDDATA11bits.S48C2
#define _S62C2 LCDDATA11bits.S62C2

/* LCDDATA12 */
#define _S0C3 LCDDATA12bits.S0C3
#define _S1C3 LCDDATA12bits.S1C3
#define _S2C3 LCDDATA12bits.S2C3
#define _S3C3 LCDDATA12bits.S3C3
#define _S4C3 LCDDATA12bits.S4C3
#define _S5C3 LCDDATA12bits.S5C3
#define _S6C3 LCDDATA12bits.S6C3
#define _S7C3 LCDDATA12bits.S7C3
#define _S8C3 LCDDATA12bits.S8C3
#define _S9C3 LCDDATA12bits.S9C3
#define _S10C3 LCDDATA12bits.S10C3
#define _S11C3 LCDDATA12bits.S11C3
#define _S12C3 LCDDATA12bits.S12C3
#define _S13C3 LCDDATA12bits.S13C3
#define _S14C3 LCDDATA12bits.S14C3
#define _S15C3 LCDDATA12bits.S15C3

/* LCDDATA13 */
#define _S16C3 LCDDATA13bits.S16C3
#define _S17C3 LCDDATA13bits.S17C3
#define _S18C3 LCDDATA13bits.S18C3
#define _S19C3 LCDDATA13bits.S19C3
#define _S20C3 LCDDATA13bits.S20C3
#define _S21C3 LCDDATA13bits.S21C3
#define _S22C3 LCDDATA13bits.S22C3
#define _S23C3 LCDDATA13bits.S23C3
#define _S24C3 LCDDATA13bits.S24C3
#define _S25C3 LCDDATA13bits.S25C3
#define _S26C3 LCDDATA13bits.S26C3
#define _S27C3 LCDDATA13bits.S27C3
#define _S30C3 LCDDATA13bits.S30C3

/* LCDDATA14 */
#define _S47C3 LCDDATA14bits.S47C3

/* LCDDATA15 */
#define _S48C3 LCDDATA15bits.S48C3
#define _S62C3 LCDDATA15bits.S62C3

/* LCDDATA16 */
#define _S0C4 LCDDATA16bits.S0C4
#define _S1C4 LCDDATA16bits.S1C4
#define _S2C4 LCDDATA16bits.S2C4
#define _S3C4 LCDDATA16bits.S3C4
#define _S4C4 LCDDATA16bits.S4C4
#define _S5C4 LCDDATA16bits.S5C4
#define _S6C4 LCDDATA16bits.S6C4
#define _S7C4 LCDDATA16bits.S7C4
#define _S8C4 LCDDATA16bits.S8C4
#define _S9C4 LCDDATA16bits.S9C4
#define _S10C4 LCDDATA16bits.S10C4
#define _S11C4 LCDDATA16bits.S11C4
#define _S12C4 LCDDATA16bits.S12C4
#define _S13C4 LCDDATA16bits.S13C4
#define _S14C4 LCDDATA16bits.S14C4
#define _S15C4 LCDDATA16bits.S15C4

/* LCDDATA17 */
#define _S16C4 LCDDATA17bits.S16C4
#define _S17C4 LCDDATA17bits.S17C4
#define _S18C4 LCDDATA17bits.S18C4
#define _S19C4 LCDDATA17bits.S19C4
#define _S20C4 LCDDATA17bits.S20C4
#define _S21C4 LCDDATA17bits.S21C4
#define _S22C4 LCDDATA17bits.S22C4
#define _S23C4 LCDDATA17bits.S23C4
#define _S24C4 LCDDATA17bits.S24C4
#define _S25C4 LCDDATA17bits.S25C4
#define _S26C4 LCDDATA17bits.S26C4
#define _S27C4 LCDDATA17bits.S27C4
#define _S30C4 LCDDATA17bits.S30C4

/* LCDDATA18 */
#define _S47C4 LCDDATA18bits.S47C4

/* LCDDATA19 */
#define _S48C4 LCDDATA19bits.S48C4
#define _S62C4 LCDDATA19bits.S62C4

/* LCDDATA20 */
#define _S0C5 LCDDATA20bits.S0C5
#define _S1C5 LCDDATA20bits.S1C5
#define _S2C5 LCDDATA20bits.S2C5
#define _S3C5 LCDDATA20bits.S3C5
#define _S4C5 LCDDATA20bits.S4C5
#define _S5C5 LCDDATA20bits.S5C5
#define _S6C5 LCDDATA20bits.S6C5
#define _S7C5 LCDDATA20bits.S7C5
#define _S8C5 LCDDATA20bits.S8C5
#define _S9C5 LCDDATA20bits.S9C5
#define _S10C5 LCDDATA20bits.S10C5
#define _S11C5 LCDDATA20bits.S11C5
#define _S12C5 LCDDATA20bits.S12C5
#define _S13C5 LCDDATA20bits.S13C5
#define _S14C5 LCDDATA20bits.S14C5
#define _S15C5 LCDDATA20bits.S15C5

/* LCDDATA21 */
#define _S16C5 LCDDATA21bits.S16C5
#define _S17C5 LCDDATA21bits.S17C5
#define _S18C5 LCDDATA21bits.S18C5
#define _S19C5 LCDDATA21bits.S19C5
#define _S20C5 LCDDATA21bits.S20C5
#define _S21C5 LCDDATA21bits.S21C5
#define _S22C5 LCDDATA21bits.S22C5
#define _S23C5 LCDDATA21bits.S23C5
#define _S24C5 LCDDATA21bits.S24C5
#define _S25C5 LCDDATA21bits.S25C5
#define _S26C5 LCDDATA21bits.S26C5
#define _S27C5 LCDDATA21bits.S27C5
#define _S30C5 LCDDATA21bits.S30C5

/* LCDDATA22 */
#define _S47C5 LCDDATA22bits.S47C5

/* LCDDATA23 */
#define _S48C5 LCDDATA23bits.S48C5
#define _S62C5 LCDDATA23bits.S62C5

/* LCDDATA24 */
#define _S0C6 LCDDATA24bits.S0C6
#define _S1C6 LCDDATA24bits.S1C6
#define _S2C6 LCDDATA24bits.S2C6
#define _S3C6 LCDDATA24bits.S3C6
#define _S4C6 LCDDATA24bits.S4C6
#define _S5C6 LCDDATA24bits.S5C6
#define _S6C6 LCDDATA24bits.S6C6
#define _S7C6 LCDDATA24bits.S7C6
#define _S8C6 LCDDATA24bits.S8C6
#define _S9C6 LCDDATA24bits.S9C6
#define _S10C6 LCDDATA24bits.S10C6
#define _S11C6 LCDDATA24bits.S11C6
#define _S12C6 LCDDATA24bits.S12C6
#define _S13C6 LCDDATA24bits.S13C6
#define _S14C6 LCDDATA24bits.S14C6
#define _S15C6 LCDDATA24bits.S15C6

/* LCDDATA25 */
#define _S16C6 LCDDATA25bits.S16C6
#define _S17C6 LCDDATA25bits.S17C6
#define _S18C6 LCDDATA25bits.S18C6
#define _S19C6 LCDDATA25bits.S19C6
#define _S20C6 LCDDATA25bits.S20C6
#define _S21C6 LCDDATA25bits.S21C6
#define _S22C6 LCDDATA25bits.S22C6
#define _S23C6 LCDDATA25bits.S23C6
#define _S24C6 LCDDATA25bits.S24C6
#define _S25C6 LCDDATA25bits.S25C6
#define _S26C6 LCDDATA25bits.S26C6
#define _S27C6 LCDDATA25bits.S27C6
#define _S30C6 LCDDATA25bits.S30C6

/* LCDDATA26 */
#define _S47C6 LCDDATA26bits.S47C6

/* LCDDATA27 */
#define _S48C6 LCDDATA27bits.S48C6
#define _S62C6 LCDDATA27bits.S62C6

/* LCDDATA28 */
#define _S0C7 LCDDATA28bits.S0C7
#define _S1C7 LCDDATA28bits.S1C7
#define _S2C7 LCDDATA28bits.S2C7
#define _S3C7 LCDDATA28bits.S3C7
#define _S4C7 LCDDATA28bits.S4C7
#define _S5C7 LCDDATA28bits.S5C7
#define _S6C7 LCDDATA28bits.S6C7
#define _S7C7 LCDDATA28bits.S7C7
#define _S8C7 LCDDATA28bits.S8C7
#define _S9C7 LCDDATA28bits.S9C7
#define _S10C7 LCDDATA28bits.S10C7
#define _S11C7 LCDDATA28bits.S11C7
#define _S12C7 LCDDATA28bits.S12C7
#define _S13C7 LCDDATA28bits.S13C7
#define _S14C7 LCDDATA28bits.S14C7
#define _S15C7 LCDDATA28bits.S15C7

/* LCDDATA29 */
#define _S16C7 LCDDATA29bits.S16C7
#define _S17C7 LCDDATA29bits.S17C7
#define _S18C7 LCDDATA29bits.S18C7
#define _S19C7 LCDDATA29bits.S19C7
#define _S20C7 LCDDATA29bits.S20C7
#define _S21C7 LCDDATA29bits.S21C7
#define _S22C7 LCDDATA29bits.S22C7
#define _S23C7 LCDDATA29bits.S23C7
#define _S24C7 LCDDATA29bits.S24C7
#define _S25C7 LCDDATA29bits.S25C7
#define _S26C7 LCDDATA29bits.S26C7
#define _S27C7 LCDDATA29bits.S27C7
#define _S30C7 LCDDATA29bits.S30C7

