Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define _T3CON_TIECS0_POSITION                   0x00000008
#define _T3CON_TIECS0_MASK                       0x00000100
#define _T3CON_TIECS0_LENGTH                     0x00000001

#define _T3CON_TIECS1_POSITION                   0x00000009
#define _T3CON_TIECS1_MASK                       0x00000200
#define _T3CON_TIECS1_LENGTH                     0x00000001

#define _T4CON_TCS_POSITION                      0x00000001
#define _T4CON_TCS_MASK                          0x00000002
#define _T4CON_TCS_LENGTH                        0x00000001

#define _T4CON_T32_POSITION                      0x00000003
#define _T4CON_T32_MASK                          0x00000008
#define _T4CON_T32_LENGTH                        0x00000001

#define _T4CON_TCKPS_POSITION                    0x00000004
#define _T4CON_TCKPS_MASK                        0x00000030
#define _T4CON_TCKPS_LENGTH                      0x00000002

#define _T4CON_TGATE_POSITION                    0x00000006
#define _T4CON_TGATE_MASK                        0x00000040
#define _T4CON_TGATE_LENGTH                      0x00000001

#define _T4CON_TECS_POSITION                     0x00000008
#define _T4CON_TECS_MASK                         0x00000300
#define _T4CON_TECS_LENGTH                       0x00000002

#define _T4CON_TSIDL_POSITION                    0x0000000D
#define _T4CON_TSIDL_MASK                        0x00002000
#define _T4CON_TSIDL_LENGTH                      0x00000001

#define _T4CON_TON_POSITION                      0x0000000F
#define _T4CON_TON_MASK                          0x00008000
#define _T4CON_TON_LENGTH                        0x00000001

#define _T4CON_TCKPS0_POSITION                   0x00000004
#define _T4CON_TCKPS0_MASK                       0x00000010
#define _T4CON_TCKPS0_LENGTH                     0x00000001

#define _T4CON_TCKPS1_POSITION                   0x00000005
#define _T4CON_TCKPS1_MASK                       0x00000020
#define _T4CON_TCKPS1_LENGTH                     0x00000001

#define _T4CON_TECS0_POSITION                    0x00000008
#define _T4CON_TECS0_MASK                        0x00000100
#define _T4CON_TECS0_LENGTH                      0x00000001

#define _T4CON_TECS1_POSITION                    0x00000009
#define _T4CON_TECS1_MASK                        0x00000200
#define _T4CON_TECS1_LENGTH                      0x00000001

#define _T4CON_TIECS_POSITION                    0x00000008
#define _T4CON_TIECS_MASK                        0x00000300
#define _T4CON_TIECS_LENGTH                      0x00000002

#define _T4CON_TIECS0_POSITION                   0x00000008
#define _T4CON_TIECS0_MASK                       0x00000100
#define _T4CON_TIECS0_LENGTH                     0x00000001

#define _T4CON_TIECS1_POSITION                   0x00000009
#define _T4CON_TIECS1_MASK                       0x00000200
#define _T4CON_TIECS1_LENGTH                     0x00000001

#define _T4CON_T45_POSITION                      0x00000003
#define _T4CON_T45_MASK                          0x00000008
#define _T4CON_T45_LENGTH                        0x00000001

#define _T5CON_TCS_POSITION                      0x00000001
#define _T5CON_TCS_MASK                          0x00000002
#define _T5CON_TCS_LENGTH                        0x00000001

#define _T5CON_TCKPS_POSITION                    0x00000004
#define _T5CON_TCKPS_MASK                        0x00000030
#define _T5CON_TCKPS_LENGTH                      0x00000002

#define _T5CON_TGATE_POSITION                    0x00000006
#define _T5CON_TGATE_MASK                        0x00000040
#define _T5CON_TGATE_LENGTH                      0x00000001

#define _T5CON_TECS_POSITION                     0x00000008
#define _T5CON_TECS_MASK                         0x00000300
#define _T5CON_TECS_LENGTH                       0x00000002

#define _T5CON_TSIDL_POSITION                    0x0000000D
#define _T5CON_TSIDL_MASK                        0x00002000
#define _T5CON_TSIDL_LENGTH                      0x00000001

#define _T5CON_TON_POSITION                      0x0000000F
#define _T5CON_TON_MASK                          0x00008000
#define _T5CON_TON_LENGTH                        0x00000001

#define _T5CON_TCKPS0_POSITION                   0x00000004
#define _T5CON_TCKPS0_MASK                       0x00000010
#define _T5CON_TCKPS0_LENGTH                     0x00000001

#define _T5CON_TCKPS1_POSITION                   0x00000005
#define _T5CON_TCKPS1_MASK                       0x00000020
#define _T5CON_TCKPS1_LENGTH                     0x00000001

#define _T5CON_TECS0_POSITION                    0x00000008
#define _T5CON_TECS0_MASK                        0x00000100
#define _T5CON_TECS0_LENGTH                      0x00000001

#define _T5CON_TECS1_POSITION                    0x00000009
#define _T5CON_TECS1_MASK                        0x00000200
#define _T5CON_TECS1_LENGTH                      0x00000001

#define _T5CON_TIECS_POSITION                    0x00000008
#define _T5CON_TIECS_MASK                        0x00000300
#define _T5CON_TIECS_LENGTH                      0x00000002

#define _T5CON_TIECS0_POSITION                   0x00000008
#define _T5CON_TIECS0_MASK                       0x00000100
#define _T5CON_TIECS0_LENGTH                     0x00000001

#define _T5CON_TIECS1_POSITION                   0x00000009
#define _T5CON_TIECS1_MASK                       0x00000200
#define _T5CON_TIECS1_LENGTH                     0x00000001

#define _IC1CON1_ICM_POSITION                    0x00000000
#define _IC1CON1_ICM_MASK                        0x00000007
#define _IC1CON1_ICM_LENGTH                      0x00000003

#define _IC1CON1_ICBNE_POSITION                  0x00000003
#define _IC1CON1_ICBNE_MASK                      0x00000008
#define _IC1CON1_ICBNE_LENGTH                    0x00000001

#define _IC1CON1_ICOV_POSITION                   0x00000004
#define _IC1CON1_ICOV_MASK                       0x00000010
#define _IC1CON1_ICOV_LENGTH                     0x00000001

#define _IC1CON1_ICI_POSITION                    0x00000005
#define _IC1CON1_ICI_MASK                        0x00000060
#define _IC1CON1_ICI_LENGTH                      0x00000002

#define _IC1CON1_ICTSEL_POSITION                 0x0000000A
#define _IC1CON1_ICTSEL_MASK                     0x00001C00
#define _IC1CON1_ICTSEL_LENGTH                   0x00000003

#define _IC1CON1_ICSIDL_POSITION                 0x0000000D
#define _IC1CON1_ICSIDL_MASK                     0x00002000
#define _IC1CON1_ICSIDL_LENGTH                   0x00000001

