Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define _SD1CON3_SDOSR2_POSITION                 0x0000000C
#define _SD1CON3_SDOSR2_MASK                     0x00001000
#define _SD1CON3_SDOSR2_LENGTH                   0x00000001

#define _SD1CON3_SDDIV0_POSITION                 0x0000000D
#define _SD1CON3_SDDIV0_MASK                     0x00002000
#define _SD1CON3_SDDIV0_LENGTH                   0x00000001

#define _SD1CON3_SDDIV1_POSITION                 0x0000000E
#define _SD1CON3_SDDIV1_MASK                     0x00004000
#define _SD1CON3_SDDIV1_LENGTH                   0x00000001

#define _SD1CON3_SDDIV2_POSITION                 0x0000000F
#define _SD1CON3_SDDIV2_MASK                     0x00008000
#define _SD1CON3_SDDIV2_LENGTH                   0x00000001

#define _ANCFG_VBG2EN_POSITION                   0x00000002
#define _ANCFG_VBG2EN_MASK                       0x00000004
#define _ANCFG_VBG2EN_LENGTH                     0x00000001

#define _ANSB_ANSB0_POSITION                     0x00000000
#define _ANSB_ANSB0_MASK                         0x00000001
#define _ANSB_ANSB0_LENGTH                       0x00000001

#define _ANSB_ANSB1_POSITION                     0x00000001
#define _ANSB_ANSB1_MASK                         0x00000002
#define _ANSB_ANSB1_LENGTH                       0x00000001

#define _ANSB_ANSB2_POSITION                     0x00000002
#define _ANSB_ANSB2_MASK                         0x00000004
#define _ANSB_ANSB2_LENGTH                       0x00000001

#define _ANSB_ANSB3_POSITION                     0x00000003
#define _ANSB_ANSB3_MASK                         0x00000008
#define _ANSB_ANSB3_LENGTH                       0x00000001

#define _ANSB_ANSB4_POSITION                     0x00000004
#define _ANSB_ANSB4_MASK                         0x00000010
#define _ANSB_ANSB4_LENGTH                       0x00000001

#define _ANSB_ANSB5_POSITION                     0x00000005
#define _ANSB_ANSB5_MASK                         0x00000020
#define _ANSB_ANSB5_LENGTH                       0x00000001

#define _ANSB_ANSB6_POSITION                     0x00000006
#define _ANSB_ANSB6_MASK                         0x00000040
#define _ANSB_ANSB6_LENGTH                       0x00000001

#define _ANSB_ANSB7_POSITION                     0x00000007
#define _ANSB_ANSB7_MASK                         0x00000080
#define _ANSB_ANSB7_LENGTH                       0x00000001

#define _ANSB_ANSB12_POSITION                    0x0000000C
#define _ANSB_ANSB12_MASK                        0x00001000
#define _ANSB_ANSB12_LENGTH                      0x00000001

#define _ANSB_ANSB13_POSITION                    0x0000000D
#define _ANSB_ANSB13_MASK                        0x00002000
#define _ANSB_ANSB13_LENGTH                      0x00000001

#define _ANSB_ANSB14_POSITION                    0x0000000E
#define _ANSB_ANSB14_MASK                        0x00004000
#define _ANSB_ANSB14_LENGTH                      0x00000001

#define _ANSB_ANSB15_POSITION                    0x0000000F
#define _ANSB_ANSB15_MASK                        0x00008000
#define _ANSB_ANSB15_LENGTH                      0x00000001

#define _ANSD_ANSD0_POSITION                     0x00000000
#define _ANSD_ANSD0_MASK                         0x00000001
#define _ANSD_ANSD0_LENGTH                       0x00000001

#define _ANSD_ANSD1_POSITION                     0x00000001
#define _ANSD_ANSD1_MASK                         0x00000002
#define _ANSD_ANSD1_LENGTH                       0x00000001

#define _ANSD_ANSD2_POSITION                     0x00000002
#define _ANSD_ANSD2_MASK                         0x00000004
#define _ANSD_ANSD2_LENGTH                       0x00000001

#define _ANSD_ANSD3_POSITION                     0x00000003
#define _ANSD_ANSD3_MASK                         0x00000008
#define _ANSD_ANSD3_LENGTH                       0x00000001

#define _ANSD_ANSD4_POSITION                     0x00000004
#define _ANSD_ANSD4_MASK                         0x00000010
#define _ANSD_ANSD4_LENGTH                       0x00000001

#define _ANSD_ANSD5_POSITION                     0x00000005
#define _ANSD_ANSD5_MASK                         0x00000020
#define _ANSD_ANSD5_LENGTH                       0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSD_ANSD8_POSITION                     0x00000008
#define _ANSD_ANSD8_MASK                         0x00000100
#define _ANSD_ANSD8_LENGTH                       0x00000001

#define _ANSD_ANSD9_POSITION                     0x00000009
#define _ANSD_ANSD9_MASK                         0x00000200
#define _ANSD_ANSD9_LENGTH                       0x00000001

#define _ANSD_ANSD10_POSITION                    0x0000000A
#define _ANSD_ANSD10_MASK                        0x00000400
#define _ANSD_ANSD10_LENGTH                      0x00000001

#define _ANSD_ANSD11_POSITION                    0x0000000B
#define _ANSD_ANSD11_MASK                        0x00000800
#define _ANSD_ANSD11_LENGTH                      0x00000001

#define _ANSD_ANSD12_POSITION                    0x0000000C
#define _ANSD_ANSD12_MASK                        0x00001000
#define _ANSD_ANSD12_LENGTH                      0x00000001

#define _ANSD_ANSD13_POSITION                    0x0000000D
#define _ANSD_ANSD13_MASK                        0x00002000
#define _ANSD_ANSD13_LENGTH                      0x00000001

#define _ANSD_ANSD14_POSITION                    0x0000000E
#define _ANSD_ANSD14_MASK                        0x00004000
#define _ANSD_ANSD14_LENGTH                      0x00000001

#define _ANSD_ANSD15_POSITION                    0x0000000F
#define _ANSD_ANSD15_MASK                        0x00008000
#define _ANSD_ANSD15_LENGTH                      0x00000001

#define _ANSE_ANSE4_POSITION                     0x00000004
#define _ANSE_ANSE4_MASK                         0x00000010
#define _ANSE_ANSE4_LENGTH                       0x00000001

#define _ANSE_ANSE5_POSITION                     0x00000005
#define _ANSE_ANSE5_MASK                         0x00000020
#define _ANSE_ANSE5_LENGTH                       0x00000001

#define _ANSE_ANSE6_POSITION                     0x00000006
#define _ANSE_ANSE6_MASK                         0x00000040
#define _ANSE_ANSE6_LENGTH                       0x00000001

