Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define _ADCON3_ADCS3_POSITION                   0x00000003
#define _ADCON3_ADCS3_MASK                       0x00000008
#define _ADCON3_ADCS3_LENGTH                     0x00000001

#define _ADCON3_ADCS4_POSITION                   0x00000004
#define _ADCON3_ADCS4_MASK                       0x00000010
#define _ADCON3_ADCS4_LENGTH                     0x00000001

#define _ADCON3_ADCS5_POSITION                   0x00000005
#define _ADCON3_ADCS5_MASK                       0x00000020
#define _ADCON3_ADCS5_LENGTH                     0x00000001

#define _ADCON3_ADCS6_POSITION                   0x00000006
#define _ADCON3_ADCS6_MASK                       0x00000040
#define _ADCON3_ADCS6_LENGTH                     0x00000001

#define _ADCON3_ADCS7_POSITION                   0x00000007
#define _ADCON3_ADCS7_MASK                       0x00000080
#define _ADCON3_ADCS7_LENGTH                     0x00000001

#define _ADCON3_SLEN_POSITION                    0x00000008
#define _ADCON3_SLEN_MASK                        0x00000F00
#define _ADCON3_SLEN_LENGTH                      0x00000004

#define _ADCON3_SLEN0_POSITION                   0x00000008
#define _ADCON3_SLEN0_MASK                       0x00000100
#define _ADCON3_SLEN0_LENGTH                     0x00000001

#define _ADCON3_SLEN1_POSITION                   0x00000009
#define _ADCON3_SLEN1_MASK                       0x00000200
#define _ADCON3_SLEN1_LENGTH                     0x00000001

#define _ADCON3_SLEN2_POSITION                   0x0000000A
#define _ADCON3_SLEN2_MASK                       0x00000400
#define _ADCON3_SLEN2_LENGTH                     0x00000001

#define _ADCON3_SLEN3_POSITION                   0x0000000B
#define _ADCON3_SLEN3_MASK                       0x00000800
#define _ADCON3_SLEN3_LENGTH                     0x00000001

#define _ADSTATL_SL0IF_POSITION                  0x00000000
#define _ADSTATL_SL0IF_MASK                      0x00000001
#define _ADSTATL_SL0IF_LENGTH                    0x00000001

#define _ADSTATL_SL1IF_POSITION                  0x00000001
#define _ADSTATL_SL1IF_MASK                      0x00000002
#define _ADSTATL_SL1IF_LENGTH                    0x00000001

#define _ADSTATL_SL2IF_POSITION                  0x00000002
#define _ADSTATL_SL2IF_MASK                      0x00000004
#define _ADSTATL_SL2IF_LENGTH                    0x00000001

#define _ADSTATL_SL3IF_POSITION                  0x00000003
#define _ADSTATL_SL3IF_MASK                      0x00000008
#define _ADSTATL_SL3IF_LENGTH                    0x00000001

#define _ADSTATL_ACCIF_POSITION                  0x00000004
#define _ADSTATL_ACCIF_MASK                      0x00000010
#define _ADSTATL_ACCIF_LENGTH                    0x00000001

#define _ADSTATL_BUFIF_POSITION                  0x00000005
#define _ADSTATL_BUFIF_MASK                      0x00000020
#define _ADSTATL_BUFIF_LENGTH                    0x00000001

#define _ADSTATL_SLERR_POSITION                  0x00000008
#define _ADSTATL_SLERR_MASK                      0x00000F00
#define _ADSTATL_SLERR_LENGTH                    0x00000004

#define _ADSTATL_SLERR0_POSITION                 0x00000008
#define _ADSTATL_SLERR0_MASK                     0x00000100
#define _ADSTATL_SLERR0_LENGTH                   0x00000001

#define _ADSTATL_SLERR1_POSITION                 0x00000009
#define _ADSTATL_SLERR1_MASK                     0x00000200
#define _ADSTATL_SLERR1_LENGTH                   0x00000001

#define _ADSTATL_SLERR2_POSITION                 0x0000000A
#define _ADSTATL_SLERR2_MASK                     0x00000400
#define _ADSTATL_SLERR2_LENGTH                   0x00000001

#define _ADSTATL_SLERR3_POSITION                 0x0000000B
#define _ADSTATL_SLERR3_MASK                     0x00000800
#define _ADSTATL_SLERR3_LENGTH                   0x00000001

#define _ADSTATL_SLOV_POSITION                   0x00000008
#define _ADSTATL_SLOV_MASK                       0x00000100
#define _ADSTATL_SLOV_LENGTH                     0x00000001

#define _ADSTATH_ADBUSY_POSITION                 0x00000000
#define _ADSTATH_ADBUSY_MASK                     0x00000001
#define _ADSTATH_ADBUSY_LENGTH                   0x00000001

#define _ADSTATH_ADREADY_POSITION                0x00000001
#define _ADSTATH_ADREADY_MASK                    0x00000002
#define _ADSTATH_ADREADY_LENGTH                  0x00000001

#define _ADSTATH_PUMPST_POSITION                 0x00000002
#define _ADSTATH_PUMPST_MASK                     0x00000004
#define _ADSTATH_PUMPST_LENGTH                   0x00000001

#define _ACCONL_COUNT_POSITION                   0x00000000
#define _ACCONL_COUNT_MASK                       0x000000FF
#define _ACCONL_COUNT_LENGTH                     0x00000008

#define _ACCONL_TBLSEL_POSITION                  0x00000008
#define _ACCONL_TBLSEL_MASK                      0x00003F00
#define _ACCONL_TBLSEL_LENGTH                    0x00000006

#define _ACCONL_COUNT0_POSITION                  0x00000000
#define _ACCONL_COUNT0_MASK                      0x00000001
#define _ACCONL_COUNT0_LENGTH                    0x00000001

#define _ACCONL_COUNT1_POSITION                  0x00000001
#define _ACCONL_COUNT1_MASK                      0x00000002
#define _ACCONL_COUNT1_LENGTH                    0x00000001

#define _ACCONL_COUNT2_POSITION                  0x00000002
#define _ACCONL_COUNT2_MASK                      0x00000004
#define _ACCONL_COUNT2_LENGTH                    0x00000001

#define _ACCONL_COUNT3_POSITION                  0x00000003
#define _ACCONL_COUNT3_MASK                      0x00000008
#define _ACCONL_COUNT3_LENGTH                    0x00000001

#define _ACCONL_COUNT4_POSITION                  0x00000004
#define _ACCONL_COUNT4_MASK                      0x00000010
#define _ACCONL_COUNT4_LENGTH                    0x00000001

#define _ACCONL_COUNT5_POSITION                  0x00000005
#define _ACCONL_COUNT5_MASK                      0x00000020
#define _ACCONL_COUNT5_LENGTH                    0x00000001

#define _ACCONL_COUNT6_POSITION                  0x00000006
#define _ACCONL_COUNT6_MASK                      0x00000040
#define _ACCONL_COUNT6_LENGTH                    0x00000001

#define _ACCONL_COUNT7_POSITION                  0x00000007
#define _ACCONL_COUNT7_MASK                      0x00000080
#define _ACCONL_COUNT7_LENGTH                    0x00000001

