Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define _LCDSE0_SE05_POSITION                    0x00000005
#define _LCDSE0_SE05_MASK                        0x00000020
#define _LCDSE0_SE05_LENGTH                      0x00000001

#define _LCDSE0_SE06_POSITION                    0x00000006
#define _LCDSE0_SE06_MASK                        0x00000040
#define _LCDSE0_SE06_LENGTH                      0x00000001

#define _LCDSE0_SE07_POSITION                    0x00000007
#define _LCDSE0_SE07_MASK                        0x00000080
#define _LCDSE0_SE07_LENGTH                      0x00000001

#define _LCDSE0_SE08_POSITION                    0x00000008
#define _LCDSE0_SE08_MASK                        0x00000100
#define _LCDSE0_SE08_LENGTH                      0x00000001

#define _LCDSE0_SE09_POSITION                    0x00000009
#define _LCDSE0_SE09_MASK                        0x00000200
#define _LCDSE0_SE09_LENGTH                      0x00000001

#define _LCDSE0_SE10_POSITION                    0x0000000A
#define _LCDSE0_SE10_MASK                        0x00000400
#define _LCDSE0_SE10_LENGTH                      0x00000001

#define _LCDSE0_SE11_POSITION                    0x0000000B
#define _LCDSE0_SE11_MASK                        0x00000800
#define _LCDSE0_SE11_LENGTH                      0x00000001

#define _LCDSE0_SE12_POSITION                    0x0000000C
#define _LCDSE0_SE12_MASK                        0x00001000
#define _LCDSE0_SE12_LENGTH                      0x00000001

#define _LCDSE0_SE13_POSITION                    0x0000000D
#define _LCDSE0_SE13_MASK                        0x00002000
#define _LCDSE0_SE13_LENGTH                      0x00000001

#define _LCDSE0_SE14_POSITION                    0x0000000E
#define _LCDSE0_SE14_MASK                        0x00004000
#define _LCDSE0_SE14_LENGTH                      0x00000001

#define _LCDSE0_SE15_POSITION                    0x0000000F
#define _LCDSE0_SE15_MASK                        0x00008000
#define _LCDSE0_SE15_LENGTH                      0x00000001

#define _LCDSE1_SE16_POSITION                    0x00000000
#define _LCDSE1_SE16_MASK                        0x00000001
#define _LCDSE1_SE16_LENGTH                      0x00000001

#define _LCDSE1_SE17_POSITION                    0x00000001
#define _LCDSE1_SE17_MASK                        0x00000002
#define _LCDSE1_SE17_LENGTH                      0x00000001

#define _LCDSE1_SE18_POSITION                    0x00000002
#define _LCDSE1_SE18_MASK                        0x00000004
#define _LCDSE1_SE18_LENGTH                      0x00000001

#define _LCDSE1_SE19_POSITION                    0x00000003
#define _LCDSE1_SE19_MASK                        0x00000008
#define _LCDSE1_SE19_LENGTH                      0x00000001

#define _LCDSE1_SE20_POSITION                    0x00000004
#define _LCDSE1_SE20_MASK                        0x00000010
#define _LCDSE1_SE20_LENGTH                      0x00000001

#define _LCDSE1_SE21_POSITION                    0x00000005
#define _LCDSE1_SE21_MASK                        0x00000020
#define _LCDSE1_SE21_LENGTH                      0x00000001

#define _LCDSE1_SE22_POSITION                    0x00000006
#define _LCDSE1_SE22_MASK                        0x00000040
#define _LCDSE1_SE22_LENGTH                      0x00000001

#define _LCDSE1_SE23_POSITION                    0x00000007
#define _LCDSE1_SE23_MASK                        0x00000080
#define _LCDSE1_SE23_LENGTH                      0x00000001

#define _LCDSE1_SE24_POSITION                    0x00000008
#define _LCDSE1_SE24_MASK                        0x00000100
#define _LCDSE1_SE24_LENGTH                      0x00000001

#define _LCDSE1_SE25_POSITION                    0x00000009
#define _LCDSE1_SE25_MASK                        0x00000200
#define _LCDSE1_SE25_LENGTH                      0x00000001

#define _LCDSE1_SE26_POSITION                    0x0000000A
#define _LCDSE1_SE26_MASK                        0x00000400
#define _LCDSE1_SE26_LENGTH                      0x00000001

#define _LCDSE1_SE27_POSITION                    0x0000000B
#define _LCDSE1_SE27_MASK                        0x00000800
#define _LCDSE1_SE27_LENGTH                      0x00000001

#define _LCDSE1_SE30_POSITION                    0x0000000E
#define _LCDSE1_SE30_MASK                        0x00004000
#define _LCDSE1_SE30_LENGTH                      0x00000001

#define _LCDSE2_SE47_POSITION                    0x0000000F
#define _LCDSE2_SE47_MASK                        0x00008000
#define _LCDSE2_SE47_LENGTH                      0x00000001

#define _LCDSE3_SE48_POSITION                    0x00000000
#define _LCDSE3_SE48_MASK                        0x00000001
#define _LCDSE3_SE48_LENGTH                      0x00000001

#define _LCDSE3_SE62_POSITION                    0x0000000E
#define _LCDSE3_SE62_MASK                        0x00004000
#define _LCDSE3_SE62_LENGTH                      0x00000001

#define _LCDDATA0_S0C0_POSITION                  0x00000000
#define _LCDDATA0_S0C0_MASK                      0x00000001
#define _LCDDATA0_S0C0_LENGTH                    0x00000001

#define _LCDDATA0_S1C0_POSITION                  0x00000001
#define _LCDDATA0_S1C0_MASK                      0x00000002
#define _LCDDATA0_S1C0_LENGTH                    0x00000001

#define _LCDDATA0_S2C0_POSITION                  0x00000002
#define _LCDDATA0_S2C0_MASK                      0x00000004
#define _LCDDATA0_S2C0_LENGTH                    0x00000001

#define _LCDDATA0_S3C0_POSITION                  0x00000003
#define _LCDDATA0_S3C0_MASK                      0x00000008
#define _LCDDATA0_S3C0_LENGTH                    0x00000001

#define _LCDDATA0_S4C0_POSITION                  0x00000004
#define _LCDDATA0_S4C0_MASK                      0x00000010
#define _LCDDATA0_S4C0_LENGTH                    0x00000001

#define _LCDDATA0_S5C0_POSITION                  0x00000005
#define _LCDDATA0_S5C0_MASK                      0x00000020
#define _LCDDATA0_S5C0_LENGTH                    0x00000001

#define _LCDDATA0_S6C0_POSITION                  0x00000006
#define _LCDDATA0_S6C0_MASK                      0x00000040
#define _LCDDATA0_S6C0_LENGTH                    0x00000001

