Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define _LCDDATA5_S17C1_POSITION                 0x00000001
#define _LCDDATA5_S17C1_MASK                     0x00000002
#define _LCDDATA5_S17C1_LENGTH                   0x00000001

#define _LCDDATA5_S18C1_POSITION                 0x00000002
#define _LCDDATA5_S18C1_MASK                     0x00000004
#define _LCDDATA5_S18C1_LENGTH                   0x00000001

#define _LCDDATA5_S19C1_POSITION                 0x00000003
#define _LCDDATA5_S19C1_MASK                     0x00000008
#define _LCDDATA5_S19C1_LENGTH                   0x00000001

#define _LCDDATA5_S20C1_POSITION                 0x00000004
#define _LCDDATA5_S20C1_MASK                     0x00000010
#define _LCDDATA5_S20C1_LENGTH                   0x00000001

#define _LCDDATA5_S21C1_POSITION                 0x00000005
#define _LCDDATA5_S21C1_MASK                     0x00000020
#define _LCDDATA5_S21C1_LENGTH                   0x00000001

#define _LCDDATA5_S22C1_POSITION                 0x00000006
#define _LCDDATA5_S22C1_MASK                     0x00000040
#define _LCDDATA5_S22C1_LENGTH                   0x00000001

#define _LCDDATA5_S23C1_POSITION                 0x00000007
#define _LCDDATA5_S23C1_MASK                     0x00000080
#define _LCDDATA5_S23C1_LENGTH                   0x00000001

#define _LCDDATA5_S24C1_POSITION                 0x00000008
#define _LCDDATA5_S24C1_MASK                     0x00000100
#define _LCDDATA5_S24C1_LENGTH                   0x00000001

#define _LCDDATA5_S25C1_POSITION                 0x00000009
#define _LCDDATA5_S25C1_MASK                     0x00000200
#define _LCDDATA5_S25C1_LENGTH                   0x00000001

#define _LCDDATA5_S26C1_POSITION                 0x0000000A
#define _LCDDATA5_S26C1_MASK                     0x00000400
#define _LCDDATA5_S26C1_LENGTH                   0x00000001

#define _LCDDATA5_S27C1_POSITION                 0x0000000B
#define _LCDDATA5_S27C1_MASK                     0x00000800
#define _LCDDATA5_S27C1_LENGTH                   0x00000001

#define _LCDDATA5_S30C1_POSITION                 0x0000000E
#define _LCDDATA5_S30C1_MASK                     0x00004000
#define _LCDDATA5_S30C1_LENGTH                   0x00000001

#define _LCDDATA6_S47C1_POSITION                 0x0000000F
#define _LCDDATA6_S47C1_MASK                     0x00008000
#define _LCDDATA6_S47C1_LENGTH                   0x00000001

#define _LCDDATA7_S48C1_POSITION                 0x00000000
#define _LCDDATA7_S48C1_MASK                     0x00000001
#define _LCDDATA7_S48C1_LENGTH                   0x00000001

#define _LCDDATA7_S62C1_POSITION                 0x0000000E
#define _LCDDATA7_S62C1_MASK                     0x00004000
#define _LCDDATA7_S62C1_LENGTH                   0x00000001

#define _LCDDATA8_S0C2_POSITION                  0x00000000
#define _LCDDATA8_S0C2_MASK                      0x00000001
#define _LCDDATA8_S0C2_LENGTH                    0x00000001

#define _LCDDATA8_S1C2_POSITION                  0x00000001
#define _LCDDATA8_S1C2_MASK                      0x00000002
#define _LCDDATA8_S1C2_LENGTH                    0x00000001

#define _LCDDATA8_S2C2_POSITION                  0x00000002
#define _LCDDATA8_S2C2_MASK                      0x00000004
#define _LCDDATA8_S2C2_LENGTH                    0x00000001

#define _LCDDATA8_S3C2_POSITION                  0x00000003
#define _LCDDATA8_S3C2_MASK                      0x00000008
#define _LCDDATA8_S3C2_LENGTH                    0x00000001

#define _LCDDATA8_S4C2_POSITION                  0x00000004
#define _LCDDATA8_S4C2_MASK                      0x00000010
#define _LCDDATA8_S4C2_LENGTH                    0x00000001

#define _LCDDATA8_S5C2_POSITION                  0x00000005
#define _LCDDATA8_S5C2_MASK                      0x00000020
#define _LCDDATA8_S5C2_LENGTH                    0x00000001

#define _LCDDATA8_S6C2_POSITION                  0x00000006
#define _LCDDATA8_S6C2_MASK                      0x00000040
#define _LCDDATA8_S6C2_LENGTH                    0x00000001

#define _LCDDATA8_S7C2_POSITION                  0x00000007
#define _LCDDATA8_S7C2_MASK                      0x00000080
#define _LCDDATA8_S7C2_LENGTH                    0x00000001

#define _LCDDATA8_S8C2_POSITION                  0x00000008
#define _LCDDATA8_S8C2_MASK                      0x00000100
#define _LCDDATA8_S8C2_LENGTH                    0x00000001

#define _LCDDATA8_S9C2_POSITION                  0x00000009
#define _LCDDATA8_S9C2_MASK                      0x00000200
#define _LCDDATA8_S9C2_LENGTH                    0x00000001

#define _LCDDATA8_S10C2_POSITION                 0x0000000A
#define _LCDDATA8_S10C2_MASK                     0x00000400
#define _LCDDATA8_S10C2_LENGTH                   0x00000001

#define _LCDDATA8_S11C2_POSITION                 0x0000000B
#define _LCDDATA8_S11C2_MASK                     0x00000800
#define _LCDDATA8_S11C2_LENGTH                   0x00000001

#define _LCDDATA8_S12C2_POSITION                 0x0000000C
#define _LCDDATA8_S12C2_MASK                     0x00001000
#define _LCDDATA8_S12C2_LENGTH                   0x00000001

#define _LCDDATA8_S13C2_POSITION                 0x0000000D
#define _LCDDATA8_S13C2_MASK                     0x00002000
#define _LCDDATA8_S13C2_LENGTH                   0x00000001

#define _LCDDATA8_S14C2_POSITION                 0x0000000E
#define _LCDDATA8_S14C2_MASK                     0x00004000
#define _LCDDATA8_S14C2_LENGTH                   0x00000001

#define _LCDDATA8_S15C2_POSITION                 0x0000000F
#define _LCDDATA8_S15C2_MASK                     0x00008000
#define _LCDDATA8_S15C2_LENGTH                   0x00000001

#define _LCDDATA9_S16C2_POSITION                 0x00000000
#define _LCDDATA9_S16C2_MASK                     0x00000001
#define _LCDDATA9_S16C2_LENGTH                   0x00000001

#define _LCDDATA9_S17C2_POSITION                 0x00000001
#define _LCDDATA9_S17C2_MASK                     0x00000002
#define _LCDDATA9_S17C2_LENGTH                   0x00000001

#define _LCDDATA9_S18C2_POSITION                 0x00000002
#define _LCDDATA9_S18C2_MASK                     0x00000004
#define _LCDDATA9_S18C2_LENGTH                   0x00000001

#define _LCDDATA9_S19C2_POSITION                 0x00000003
#define _LCDDATA9_S19C2_MASK                     0x00000008
#define _LCDDATA9_S19C2_LENGTH                   0x00000001

#define _LCDDATA9_S20C2_POSITION                 0x00000004
#define _LCDDATA9_S20C2_MASK                     0x00000010
#define _LCDDATA9_S20C2_LENGTH                   0x00000001

