Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC006.h
#define _LCDDATA13_S24C3_POSITION                0x00000008
#define _LCDDATA13_S24C3_MASK                    0x00000100
#define _LCDDATA13_S24C3_LENGTH                  0x00000001

#define _LCDDATA13_S25C3_POSITION                0x00000009
#define _LCDDATA13_S25C3_MASK                    0x00000200
#define _LCDDATA13_S25C3_LENGTH                  0x00000001

#define _LCDDATA13_S26C3_POSITION                0x0000000A
#define _LCDDATA13_S26C3_MASK                    0x00000400
#define _LCDDATA13_S26C3_LENGTH                  0x00000001

#define _LCDDATA13_S27C3_POSITION                0x0000000B
#define _LCDDATA13_S27C3_MASK                    0x00000800
#define _LCDDATA13_S27C3_LENGTH                  0x00000001

#define _LCDDATA13_S30C3_POSITION                0x0000000E
#define _LCDDATA13_S30C3_MASK                    0x00004000
#define _LCDDATA13_S30C3_LENGTH                  0x00000001

#define _LCDDATA14_S47C3_POSITION                0x0000000F
#define _LCDDATA14_S47C3_MASK                    0x00008000
#define _LCDDATA14_S47C3_LENGTH                  0x00000001

#define _LCDDATA15_S48C3_POSITION                0x00000000
#define _LCDDATA15_S48C3_MASK                    0x00000001
#define _LCDDATA15_S48C3_LENGTH                  0x00000001

#define _LCDDATA15_S62C3_POSITION                0x0000000E
#define _LCDDATA15_S62C3_MASK                    0x00004000
#define _LCDDATA15_S62C3_LENGTH                  0x00000001

#define _LCDDATA16_S0C4_POSITION                 0x00000000
#define _LCDDATA16_S0C4_MASK                     0x00000001
#define _LCDDATA16_S0C4_LENGTH                   0x00000001

#define _LCDDATA16_S1C4_POSITION                 0x00000001
#define _LCDDATA16_S1C4_MASK                     0x00000002
#define _LCDDATA16_S1C4_LENGTH                   0x00000001

#define _LCDDATA16_S2C4_POSITION                 0x00000002
#define _LCDDATA16_S2C4_MASK                     0x00000004
#define _LCDDATA16_S2C4_LENGTH                   0x00000001

#define _LCDDATA16_S3C4_POSITION                 0x00000003
#define _LCDDATA16_S3C4_MASK                     0x00000008
#define _LCDDATA16_S3C4_LENGTH                   0x00000001

#define _LCDDATA16_S4C4_POSITION                 0x00000004
#define _LCDDATA16_S4C4_MASK                     0x00000010
#define _LCDDATA16_S4C4_LENGTH                   0x00000001

#define _LCDDATA16_S5C4_POSITION                 0x00000005
#define _LCDDATA16_S5C4_MASK                     0x00000020
#define _LCDDATA16_S5C4_LENGTH                   0x00000001

#define _LCDDATA16_S6C4_POSITION                 0x00000006
#define _LCDDATA16_S6C4_MASK                     0x00000040
#define _LCDDATA16_S6C4_LENGTH                   0x00000001

#define _LCDDATA16_S7C4_POSITION                 0x00000007
#define _LCDDATA16_S7C4_MASK                     0x00000080
#define _LCDDATA16_S7C4_LENGTH                   0x00000001

#define _LCDDATA16_S8C4_POSITION                 0x00000008
#define _LCDDATA16_S8C4_MASK                     0x00000100
#define _LCDDATA16_S8C4_LENGTH                   0x00000001

#define _LCDDATA16_S9C4_POSITION                 0x00000009
#define _LCDDATA16_S9C4_MASK                     0x00000200
#define _LCDDATA16_S9C4_LENGTH                   0x00000001

#define _LCDDATA16_S10C4_POSITION                0x0000000A
#define _LCDDATA16_S10C4_MASK                    0x00000400
#define _LCDDATA16_S10C4_LENGTH                  0x00000001

#define _LCDDATA16_S11C4_POSITION                0x0000000B
#define _LCDDATA16_S11C4_MASK                    0x00000800
#define _LCDDATA16_S11C4_LENGTH                  0x00000001

#define _LCDDATA16_S12C4_POSITION                0x0000000C
#define _LCDDATA16_S12C4_MASK                    0x00001000
#define _LCDDATA16_S12C4_LENGTH                  0x00000001

#define _LCDDATA16_S13C4_POSITION                0x0000000D
#define _LCDDATA16_S13C4_MASK                    0x00002000
#define _LCDDATA16_S13C4_LENGTH                  0x00000001

#define _LCDDATA16_S14C4_POSITION                0x0000000E
#define _LCDDATA16_S14C4_MASK                    0x00004000
#define _LCDDATA16_S14C4_LENGTH                  0x00000001

#define _LCDDATA16_S15C4_POSITION                0x0000000F
#define _LCDDATA16_S15C4_MASK                    0x00008000
#define _LCDDATA16_S15C4_LENGTH                  0x00000001

#define _LCDDATA17_S16C4_POSITION                0x00000000
#define _LCDDATA17_S16C4_MASK                    0x00000001
#define _LCDDATA17_S16C4_LENGTH                  0x00000001

#define _LCDDATA17_S17C4_POSITION                0x00000001
#define _LCDDATA17_S17C4_MASK                    0x00000002
#define _LCDDATA17_S17C4_LENGTH                  0x00000001

#define _LCDDATA17_S18C4_POSITION                0x00000002
#define _LCDDATA17_S18C4_MASK                    0x00000004
#define _LCDDATA17_S18C4_LENGTH                  0x00000001

#define _LCDDATA17_S19C4_POSITION                0x00000003
#define _LCDDATA17_S19C4_MASK                    0x00000008
#define _LCDDATA17_S19C4_LENGTH                  0x00000001

#define _LCDDATA17_S20C4_POSITION                0x00000004
#define _LCDDATA17_S20C4_MASK                    0x00000010
#define _LCDDATA17_S20C4_LENGTH                  0x00000001

#define _LCDDATA17_S21C4_POSITION                0x00000005
#define _LCDDATA17_S21C4_MASK                    0x00000020
#define _LCDDATA17_S21C4_LENGTH                  0x00000001

#define _LCDDATA17_S22C4_POSITION                0x00000006
#define _LCDDATA17_S22C4_MASK                    0x00000040
#define _LCDDATA17_S22C4_LENGTH                  0x00000001

#define _LCDDATA17_S23C4_POSITION                0x00000007
#define _LCDDATA17_S23C4_MASK                    0x00000080
#define _LCDDATA17_S23C4_LENGTH                  0x00000001

#define _LCDDATA17_S24C4_POSITION                0x00000008
#define _LCDDATA17_S24C4_MASK                    0x00000100
#define _LCDDATA17_S24C4_LENGTH                  0x00000001

#define _LCDDATA17_S25C4_POSITION                0x00000009
#define _LCDDATA17_S25C4_MASK                    0x00000200
#define _LCDDATA17_S25C4_LENGTH                  0x00000001

#define _LCDDATA17_S26C4_POSITION                0x0000000A
#define _LCDDATA17_S26C4_MASK                    0x00000400
#define _LCDDATA17_S26C4_LENGTH                  0x00000001

#define _LCDDATA17_S27C4_POSITION                0x0000000B
#define _LCDDATA17_S27C4_MASK                    0x00000800
#define _LCDDATA17_S27C4_LENGTH                  0x00000001

#define _LCDDATA17_S30C4_POSITION                0x0000000E
#define _LCDDATA17_S30C4_MASK                    0x00004000
#define _LCDDATA17_S30C4_LENGTH                  0x00000001

#define _LCDDATA18_S47C4_POSITION                0x0000000F
#define _LCDDATA18_S47C4_MASK                    0x00008000
#define _LCDDATA18_S47C4_LENGTH                  0x00000001

#define _LCDDATA19_S48C4_POSITION                0x00000000
#define _LCDDATA19_S48C4_MASK                    0x00000001
#define _LCDDATA19_S48C4_LENGTH                  0x00000001

#define _LCDDATA19_S62C4_POSITION                0x0000000E
#define _LCDDATA19_S62C4_MASK                    0x00004000
#define _LCDDATA19_S62C4_LENGTH                  0x00000001

#define _LCDDATA20_S0C5_POSITION                 0x00000000
#define _LCDDATA20_S0C5_MASK                     0x00000001
#define _LCDDATA20_S0C5_LENGTH                   0x00000001

#define _LCDDATA20_S1C5_POSITION                 0x00000001
#define _LCDDATA20_S1C5_MASK                     0x00000002
#define _LCDDATA20_S1C5_LENGTH                   0x00000001

